In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('../datasets/carprices.csv').drop('Car Model',axis='columns')
df.head()

   Mileage  Sell Price($)  Age(yrs)
0    69000          18000         6
1    35000          34000         3
2    57000          26100         5
3    22500          40000         2
4    46000          31500         4

In [4]:
X = df[['Mileage','Age(yrs)']]
y = df['Sell Price($)']

In [5]:
from sklearn.model_selection import train_test_split

In [11]:
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.2)
X_train

    Mileage  Age(yrs)
1     35000         3
4     46000         4
10    83000         7
0     69000         6
5     59000         5
3     22500         2
2     57000         5
8     91000         8
7     72000         6
11    79000         7

In [12]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [13]:
model.fit(X_train,y_train)

LinearRegression()

In [15]:
model.predict(X_test)

array([22381.68262439, 27151.54606812, 26299.15240935])

In [16]:
y_test

9     22000
6     32000
12    33000
Name: Sell Price($), dtype: int64

In [17]:
model.score(X_test,y_test)

0.07358722177880817